test/fixtures/json/invoices_0.json

{
  "collection": [
    {
      "draftInvoiceNumber": 19,
      "soap": {
        "currentInvoiceHandle": {
          "id": 52
        }
      },
      "templates": {
        "bookingInstructions": "https://restapi.e-conomic.com/invoices/drafts/19/templates/booking-instructions",
        "self": "https://restapi.e-conomic.com/invoices/drafts/19/templates"
      },
      "date": "2019-10-09",
      "currency": "DKK",
      "exchangeRate": 100.0,
      "netAmount": 0.0,
      "netAmountInBaseCurrency": 0.0,
      "grossAmount": 0.0,
      "grossAmountInBaseCurrency": 0.0,
      "marginInBaseCurrency": -28.0,
      "marginPercentage": 0.0,
      "vatAmount": 0.0,
      "roundingAmount": 0.0,
      "costPriceInBaseCurrency": 28.0,
      "dueDate": "2019-10-17",
      "paymentTerms": {
        "paymentTermsNumber": 1,
        "daysOfCredit": 8,
        "name": "Netto 8 dage",
        "paymentTermsType": "net",
        "self": "https://restapi.e-conomic.com/payment-terms/1"
      },
      "customer": {
        "customerNumber": 1,
        "self": "https://restapi.e-conomic.com/customers/1"
      },
      "recipient": {
        "name": "Torstens Torskebutik",
        "vatZone": {
          "name": "Domestic",
          "vatZoneNumber": 1,
          "enabledForCustomer": true,
          "enabledForSupplier": true,
          "self": "https://restapi.e-conomic.com/vat-zones/1"
        }
      },
      "layout": {
        "layoutNumber": 15,
        "self": "https://restapi.e-conomic.com/layouts/15"
      },
      "pdf": {
        "download": "https://restapi.e-conomic.com/invoices/drafts/19/pdf"
      },
      "self": "https://restapi.e-conomic.com/invoices/drafts/19"
    },
    {
      "draftInvoiceNumber": 20,
      "soap": {
        "currentInvoiceHandle": {
          "id": 53
        }
      },
      "templates": {
        "bookingInstructions": "https://restapi.e-conomic.com/invoices/drafts/20/templates/booking-instructions",
        "self": "https://restapi.e-conomic.com/invoices/drafts/20/templates"
      },
      "date": "2019-10-09",
      "currency": "DKK",
      "exchangeRate": 100.0,
      "netAmount": 0.0,
      "netAmountInBaseCurrency": 0.0,
      "grossAmount": 0.0,
      "grossAmountInBaseCurrency": 0.0,
      "marginInBaseCurrency": 0.0,
      "marginPercentage": 0.0,
      "vatAmount": 0.0,
      "roundingAmount": 0.0,
      "costPriceInBaseCurrency": 0.0,
      "dueDate": "2019-11-30",
      "paymentTerms": {
        "paymentTermsNumber": 2,
        "daysOfCredit": 30,
        "name": "Løbende måned 30 dage",
        "paymentTermsType": "invoiceMonth",
        "self": "https://restapi.e-conomic.com/payment-terms/2"
      },
      "customer": {
        "customerNumber": 3050,
        "self": "https://restapi.e-conomic.com/customers/3050"
      },
      "recipient": {
        "name": "Jep",
        "vatZone": {
          "name": "Domestic",
          "vatZoneNumber": 1,
          "enabledForCustomer": true,
          "enabledForSupplier": true,
          "self": "https://restapi.e-conomic.com/vat-zones/1"
        },
        "nemHandelType": "ean"
      },
      "layout": {
        "layoutNumber": 16,
        "self": "https://restapi.e-conomic.com/layouts/16"
      },
      "pdf": {
        "download": "https://restapi.e-conomic.com/invoices/drafts/20/pdf"
      },
      "self": "https://restapi.e-conomic.com/invoices/drafts/20"
    }
  ],
  "pagination": {
    "maxPageSizeAllowed": 1000,
    "skipPages": 0,
    "pageSize": 1000,
    "results": 2,
    "resultsWithoutFilter": 2,
    "firstPage": "https://restapi.e-conomic.com/invoices/drafts?skippages=0&pagesize=1000",
    "lastPage": "https://restapi.e-conomic.com/invoices/drafts?skippages=0&pagesize=1000"
  },
  "self": "https://restapi.e-conomic.com/invoices/drafts?skippages=0&pagesize=1000"
}
